package solution._1

class Solution {
    fun lengthOfLongestSubstring(height: IntArray): Int {
        // ===== 第一步：判断题型特征 =====
        // 观察问题特征:
        //
        //
        // 判断适用动态规划的依据:
        //   重叠子问题 -
        //   最优子结构 -
        //   状态可定义 -

        // ===== 第二步：定义状态 =====
        // 单序列型, 双状态: dp[i]表示前i个元素的状态
        // 双序列型: dp[i][j] 表示两个序列前 i、j 元素的状态
        //

        // ===== 第三步: 构建状态转移方程 =====
        //

        // ===== 第四步: 初始化边界条件 =====
        // 起点, 边界, 异常值
        //

        // ===== 第五步: 确定遍历顺序 =====
        // 正序, 逆序, 多维
        //

        return 0
    }
}
